#### Terraform Plan 📖

```hcl
Acquiring state lock. This may take a few moments...
aws_iam_role.lambda_exec_role: Refreshing state... [id=TodoList-lambda-role]
aws_apigatewayv2_api.http_api: Refreshing state... [id=jthu0zvbu5]
aws_dynamodb_table.todo_list_table: Refreshing state... [id=TodoList]
aws_cognito_user_pool.user_pool: Refreshing state... [id=sa-east-1_TJ2hNKNGG]
aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=TodoList-lambda-role/arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
aws_cognito_user_pool_client.app_client: Refreshing state... [id=28229sdm71m3s9hj4j35rgql84]
aws_apigatewayv2_authorizer.cognito_authorizer: Refreshing state... [id=titabx]
aws_lambda_function.create_list_lambda: Refreshing state... [id=TodoList-CreateList]
aws_iam_policy.dynamodb_policy: Refreshing state... [id=arn:aws:iam::730335563853:policy/TodoList-dynamodb-policy]
aws_lambda_function.get_list_lambda: Refreshing state... [id=TodoList-GetList]
aws_lambda_function.update_delete_list_lambda: Refreshing state... [id=TodoList-UpdateDeleteList]
aws_iam_role_policy_attachment.dynamodb_attachment: Refreshing state... [id=TodoList-lambda-role/arn:aws:iam::730335563853:policy/TodoList-dynamodb-policy]
aws_lambda_permission.api_gtw_permission_create: Refreshing state... [id=AllowAPIGatewayToInvokeCreate]
aws_apigatewayv2_integration.create_list_integration: Refreshing state... [id=qj50and]
aws_lambda_permission.api_gtw_permission_update_delete: Refreshing state... [id=AllowAPIGatewayToInvokeUpdateDelete]
aws_apigatewayv2_integration.update_list_integration: Refreshing state... [id=vmiyui7]
aws_apigatewayv2_integration.delete_list_integration: Refreshing state... [id=uabcx92]
aws_lambda_permission.api_gtw_permission_get: Refreshing state... [id=AllowAPIGatewayToInvokeGet]
aws_apigatewayv2_integration.get_list_integration: Refreshing state... [id=djjtcgi]
aws_apigatewayv2_route.delete_list_route: Refreshing state... [id=jnzd56a]
aws_apigatewayv2_route.update_list_route: Refreshing state... [id=zn3ctad]
aws_apigatewayv2_route.create_list_route: Refreshing state... [id=wsly04o]
aws_apigatewayv2_route.get_list_route: Refreshing state... [id=80cf8l0]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_apigatewayv2_integration.create_item_integration will be created
  + resource "aws_apigatewayv2_integration" "create_item_integration" {
      + api_id                                    = "jthu0zvbu5"
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + region                                    = "sa-east-1"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.create_item_route will be created
  + resource "aws_apigatewayv2_route" "create_item_route" {
      + api_id             = "jthu0zvbu5"
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = "titabx"
      + id                 = (known after apply)
      + region             = "sa-east-1"
      + route_key          = "POST /lists/{listId}/items"
      + target             = (known after apply)
    }

  # aws_lambda_function.create_item_lambda will be created
  + resource "aws_lambda_function" "create_item_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../target/todo-lambdas-1.0-SNAPSHOT.jar"
      + function_name                  = "TodoList-CreateItem"
      + handler                        = "example.CreateItemHandler::handleRequest"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "sa-east-1"
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::730335563853:role/TodoList-lambda-role"
      + runtime                        = "java17"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "JcTl+1ydbGJlQf5muAp2QF1Q0CHLzxNxf+CmldsvWWw="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "TABLE_NAME" = "TodoList"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_function.create_list_lambda will be updated in-place
  ~ resource "aws_lambda_function" "create_list_lambda" {
        id                             = "TodoList-CreateList"
      ~ last_modified                  = "2025-10-17T21:54:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "5/erNZuR6QnxxWK7wCmq4KYhQOcrzKBQT8swr3Qgve8=" -> "JcTl+1ydbGJlQf5muAp2QF1Q0CHLzxNxf+CmldsvWWw="
        tags                           = {}
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.get_list_lambda will be updated in-place
  ~ resource "aws_lambda_function" "get_list_lambda" {
        id                             = "TodoList-GetList"
      ~ last_modified                  = "2025-10-17T21:54:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "5/erNZuR6QnxxWK7wCmq4KYhQOcrzKBQT8swr3Qgve8=" -> "JcTl+1ydbGJlQf5muAp2QF1Q0CHLzxNxf+CmldsvWWw="
        tags                           = {}
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.update_delete_list_lambda will be updated in-place
  ~ resource "aws_lambda_function" "update_delete_list_lambda" {
        id                             = "TodoList-UpdateDeleteList"
      ~ last_modified                  = "2025-10-17T21:55:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "5/erNZuR6QnxxWK7wCmq4KYhQOcrzKBQT8swr3Qgve8=" -> "JcTl+1ydbGJlQf5muAp2QF1Q0CHLzxNxf+CmldsvWWw="
        tags                           = {}
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_permission.api_gtw_permission_create_item will be created
  + resource "aws_lambda_permission" "api_gtw_permission_create_item" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "TodoList-CreateItem"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "sa-east-1"
      + source_arn          = "arn:aws:execute-api:sa-east-1:730335563853:jthu0zvbu5/*/*"
      + statement_id        = "AllowAPIGatewayToInvokeCreateItem"
      + statement_id_prefix = (known after apply)
    }

Plan: 4 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
*Pusher: @Deyvidy-Alves, Action: `pull_request`*